# WallJoinFailures Properties

---
The BuiltInFailuresWallJoinFailures type exposes the following members.
| Name| Description
---|---|---
| FailedToChangeWallJointsTypeFailure|  Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed.
Top
#### Reference
BuiltInFailuresWallJoinFailures Class
Autodesk.Revit.DB Namespace